feat(docs): upd license and documentations
